# Date: 2021-07-04
# comment ไ่มีมีผลกับโปรแกรม ใช้เพื่ออธิบายโค้ด หรือ ใช้เพื่อปิดการทำงานของโค้ดบางส่วน ใช้ # หน้าข้อความที่ต้องการ comment 
# หรือ ใช้ """ หรือ ''' หน้าข้อความที่ต้องการ comment หลายบรรทัด 

# Math Operator
# + - * /
# % หารเอาเศษ
# ** ยกกำลัง
# // หารเอาส่วน

# การติดเลขหลาย step ใน print คำนวณจากซ้ายไปขวา และ วงเล็บ () ในการกำหนดลำดับการคำนวณ
#ex1
5 + 2 * 3 - 1 - (1 + 5 ) ** 2

#ex2 check type of data
type(10)
type(10.1)
type(True)
type(1j)
type(-5)
type(10+5j)
type([1,2,"Hello"])
type("Hello") 
type((1,2,"Hello"))
type({"name":"John","age":36})
type({1,2,3,4})

#String Operator
"Hello" # ข้อความ หรือ String
"Hello" * 5 # คูณข้อความ จะเป็นการเอาข้อความมาต่อกัน 5 ครั้ง
"Hello" * 5.1   # ไม่สามารถคูณข้อความกับตัวเลขทศนิยมได้
"Hello" - 5 # ไม่สามารถลบข้อความกับตัวเลขได้
"Hello" + "World" # บวกข้อความ จะเป็นการเอาข้อความมาต่อกัน
"""
"" และ '' ใช้เหมือนกัน แต่ต้องเป็นตัวเดียวกัน ไม่สามารถเอามาต่อกันได้
ถ้าเป็นตัวแปรต่างกัน จะต้องแปลงเป็นข้อความก่อน โดยใช้ str() ครอบตัวแปร
"""

# Variable ตัวแปร  
# ตัวแปร ใช้เก็บข้อมูล และ ใช้เป็นตัวแทนของข้อมูล โดยใช้เครื่องหมาย = ในการกำหนดตัวแปร 
# และ การเรียกใช้ตัวแปรนั้นๆ โดยใช้ชื่อตัวแปรนั้นๆ ในการเรียกใช้

#ex1
box = "banana"
box
box = "apple"
box
box = 10
box = box + 5
box
# ตัวแปรสามารถเปลี่ยนค่าได้ และ สามารถเปลี่ยนชนิดข้อมูลได้ โดยไม่ต้องประกาศชนิดข้อมูล แต่ต้องเปลี่ยนชนิดข้อมูลให้ถูกต้อง ไม่งั้นจะเกิด error ได้

# การตั้งชื่อตัวแปรมีข้อห้ามอยู่
# 1. ห้ามขึ้นต้นด้วยตัวเลข
# 2. ห้ามมีช่องว่าง
# 3. ห้ามใช้ตัวอักษรพิเศษ ยกเว้น _
# 4. ห้ามใช้ keyword ของภาษา python เช่น print, type, int, float, str, list, tuple, set, dict, if, else, elif, for, while, break, continue, return, def, class, import, from, as, with, try, except, finally, raise, assert, lambda, None, True, False, and, or, not, in, is, del, global, nonlocal, pass, async, await
# 5. ห้ามใช้ชื่อซ้ำกับตัวแปรที่มีอยู่แล้ว

# การตั้งชื่อตัวแปรมีข้อแนะนำ
# 1. ใช้ภาษาอังกฤษ และ ใช้ตัวอักษรพิมพ์ใหญ่ในคำตัวแรกของคำที่สองเป็นต้นไป 
# 2. ใช้ตัวอักษรพิมพ์เล็ก และ ใช้ _ ในการแบ่งคำ
# 3. ใช้ _ ในการแบ่งคำ และ ใช้ตัวอักษรพิมพ์ใหญ่ในคำตัวแรกของคำที่สองเป็นต้นไป 
# 4. ใช้ชื่อที่สื่อความหมายได้ชัดเจน และ สื่อความหมายเดียวกันกับตัวแปรที่มีอยู่แล้ว  หรือ ชื่อที่เป็นคำสั่งของภาษา python ได้ โดยใช้ _ ในการแบ่งคำ และ ใช้ตัวอักษรพิมพ์ใหญ่ในคำตัวแรกของคำที่สองเป็นต้นไป 


name: str = input("what is your name? ") # การรับค่าจากผู้ใช้ โดยใช้ input() และ ใช้ตัวแปรเก็บค่าที่รับมา โดยใช้ชนิดข้อมูล str ในการประกาศตัวแปร และ ใช้ : ในการประกาศชนิดข้อมูล แต่ไม่จำเป็นต้องใช้ 
print('Hello', name) # การแสดงผล โดยใช้ print() และ ใช้ตัวแปรในการแสดงผล')
age: str = input("How old are you? (ปี)")
print('You are', age, 'years old') # การแสดงผล โดยใช้ print() และ ใช้ตัวแปรในการแสดงผล')
age_int_months: int = int(age) * 12 # การแปลงชนิดข้อมูล โดยใช้ชนิดข้อมูล int แปรข้อมูล age เป็นชนิดข้อมูล int
type(age_int_months)